name: "DeepQ"
layers {
  name: "state"
  type: MEMORY_DATA
  top: "state"
  top: "null1"
  memory_data_param: {
    batch_size: 32
    channels: 4
    height: 128
    width: 128
  }
}
layers {
  name: "next_state"
  type: MEMORY_DATA
  top: "next_state"
  top: "null2"
  memory_data_param: {
    batch_size: 32
    channels: 4
    height: 128
    width: 128
  }
}
layers {
  name: "action-reward"
  type: MEMORY_DATA
  top: "action"
  top: "reward"
  memory_data_param: {
    batch_size: 32
    channels: 1
    height: 1
    width: 4
  }
}
layers {
  name: "Qconv1"
  type: CONVOLUTION
  bottom: "state"
  top: "Qconv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 7
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "Qrelu1"
  type: RELU
  bottom: "Qconv1"
  top: "Qconv1"
}
layers {
  name: "Qpool1"
  type: POOLING
  bottom: "Qconv1"
  top: "Qpool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "Qconv2"
  type: CONVOLUTION
  bottom: "Qpool1"
  top: "Qconv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    kernel_size: 5
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "Qrelu2"
  type: RELU
  bottom: "Qconv2"
  top: "Qconv2"
}
layers {
  name: "Qpool2"
  type: POOLING
  bottom: "Qconv2"
  top: "Qpool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "Qconv3"
  type: CONVOLUTION
  bottom: "Qpool2"
  top: "Qconv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "Qconv3"
  top: "Qconv3"
}
layers {
  name: "Qpool3"
  type: POOLING
  bottom: "Qconv3"
  top: "Qpool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "Qfc4"
  type: INNER_PRODUCT
  bottom: "Qpool3"
  top: "Qfc4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "Qrelu4"
  type: RELU
  bottom: "Qfc4"
  top: "Qfc4"
}
layers {
  name: "Qdrop4"
  type: DROPOUT
  bottom: "Qfc4"
  top: "Qfc4"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "Qfc5"
  type: INNER_PRODUCT
  bottom: "Qfc4"
  top: "Qfc5"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "regression"
  type: EUCLIDEAN_LOSS
  bottom: "Qfc5"
  bottom: "Qfc5"
  top: "loss"
}